<template>
  <div class="artical">
    <pre>{{(() => {
            const idx = args.findIndex(a => (a.id.toString() === ((this.$route || {}).params || {}).id))
            return args[idx].content
        })()}}</pre>
  </div>
</template>

<script>
export default {
  mounted () {
    console.log(this.$route)
  },
  data () {
    return {
      args: [
        {
          id: 1,
          content: `在大多数人看来，金牌是非常具有代表性的荣誉，多半都是真金制成的，但其实不是这么回事，金牌往往都不是纯金制作的，按照奥组委要求，只要含金量达到6克就达标。
            而之所以被称为是金牌，是因为金子是贵重的金属，用金牌来代表第一名，只不过是象征性地表明该奖项最重要而已，并且颜色是金色的。
            一般情况下，各国奥运会之所的金牌都是主体是银，再在外边镀上金即可，总的来说，虽然没有纯金那么好，但也不会太差。
            但这次东京奥运会金牌却让人大跌眼镜，据外媒报道，东京奥运会金牌材料98.8%是银，几乎不含金，但却符合标准，因为每块1.2磅重的和金牌有6.7克黄金。
            这不算啥，毕竟含金量是达标的，但东京奥运会金牌上的贵金属，居然都是从废旧电子设备提炼出来的，换句话也就是说都是从垃圾堆里回收的。`
        },
        {
          id: 2,
          content: `报道称，约5000人当地时间1日在柏林多地“自发”参加抗议活动。RT如此描述抗议现场：参与者敲锣打鼓，高呼“和平、自由”、“我们要求不受限制地恢复示威权”等口号；大多数参与者未戴口罩，无视德国仍然实施的保持社交距离的规定。
            报道称，柏林警方当天出动了约2250名警察。抗议人士的数量超过警察，警方无法阻止密集人群参加抗议活动，在此背景下，警方阻止抗议活动就转变为执法人员与抗议者之间的激烈冲突。一名警方发言人援引初步数据称，大约600人已被捕。
            RT援引社交媒体等平台发布的视频称，游行人群多次冲破警察的锁链，警方粗暴地抓住一些抗议者并将他们丢在地上，还有警察对示威者拳打脚踢。`
        }
      ]
    }
  }
}
</script>
